12/data/attachments/5412db9f3f0d0576.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_2f60d643-61c0-4ce1-9600-b776e76ef1cb</nif:username>
            <nif:friendToBeAdded>Matthew_fire_Friend_79627_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>